---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ElemReferenceName
source: html/d99e624f-8cf6-5eae-0a86-a0c2bd7ea132.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ElemReferenceName Property

"Is Reference"

## Syntax (C#)
```csharp
public static ForgeTypeId ElemReferenceName { get; }
```